Production plan output also looks good:

```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.assets_distribution[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "assets_distribution" {
        id                             = "E1WZQ0VC06YFM2"
        tags                           = {
            "govuk_environment" = "production"
        }
      + web_acl_id                     = (known after apply)
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl            = 0 -> 86400
          ~ max_ttl                = 0 -> 31536000
            # (10 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_cloudfront_distribution.www_distribution[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "www_distribution" {
        id                             = "E31ESY2JHMP4Q"
        tags                           = {
            "govuk_environment" = "production"
        }
      + web_acl_id                     = (known after apply)
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl              = 0 -> 86400
          ~ max_ttl                  = 0 -> 31536000
            # (11 unchanged attributes hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl.cdn_poc_govuk will be created
  + resource "aws_wafv2_web_acl" "cdn_poc_govuk" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "cdn_poc_govuk"
      + scope      = "CLOUDFRONT"
      + tags_all   = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWS-AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesAnonymousIpList"
          + priority = 0

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAnonymousIpList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesAnonymousIpList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "cdn_poc_govuk"
          + sampled_requests_enabled   = true
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```